mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_C6/Arduino/ESP32_C6_TFT_graphicstest_240x280/ESP32_C6_TFT_graphicstest_240x280.ino
/*
 Adapted from the Adafruit and Xark's PDQ graphicstest sketch.

 See end of file for original header text and MIT license info.
 
 This sketch uses the GLCD font only.

 Make sure all the display driver and pin connections are correct by
 editing the User_Setup.h file in the TFT_eSPI library folder. 

 #########################################################################
 ###### DON'T FORGET TO UPDATE THE User_Setup.h FILE IN THE LIBRARY ######
 #########################################################################
 */

//#include <../Setup432_C6_ST7789_240x280.h>  // ESP32-C6, ST7789, 80MHz

//  Board Description : nanoESP32-C6 Board    ( Aliexpress < 5€ )

//  Arduino IDE Board : ESP32C6 Dev Module
//  Flash Mode        : QIO                   ( default )
//  USB CDC On Boot   : Enabled               ( so serial monitor works )
//  USB Connector     : "ESP32C6"             ( not "CH343" )

#include "SPI.h"
#include "TFT_eSPI.h"

// Use hardware SPI
TFT_eSPI tft = TFT_eSPI();

// Backlight Pin
const int pwmPin = 2;

unsigned long total = 0;
unsigned long tn = 0;
void setup() {
  Serial.begin(115200);
  //while (!Serial);
  Serial.println(""); 
  Serial.println("Bodmer's TFT_eSPI library Test!"); 

  #if defined(USE_HSPI_PORT)
  Serial.println(F("#define USE_HSPI_PORT")); 
  #elif defined(USE_VSPI_PORT)
  Serial.println(F("#define USE_VSPI_PORT")); 
  #elif defined(USE_FSPI_PORT)
  Serial.println(F("#define USE_FSPI_PORT")); 
  #else
  Serial.println(F("no #define USE_xSPI_PORT")); 
  #endif

  Serial.print("FSPI : ");  // 0
  Serial.println(FSPI); 

  Serial.print("HSPI : ");  // 1
  Serial.println(HSPI); 

  Serial.print("VSPI : ");  // 1 VSPI == FSPI // 0 bei 2.0.14
  Serial.println(VSPI); 

  Serial.print("SPI_PORT : ");   // must be 2 ! // 1 bei 2.0.14
  Serial.println(SPI_PORT); 

  Serial.print("SPI2_HOST : ");  // 1
  Serial.println(SPI2_HOST); 

  Serial.print("DR_REG_SPI1_BASE : 0x");  //0x60002000
  Serial.println(DR_REG_SPI1_BASE,HEX); 

  Serial.print("DR_REG_SPI2_BASE : 0x");  //0x60024000
  Serial.println(DR_REG_SPI2_BASE,HEX); 

  Serial.print("REG_SPI_BASE(1) : 0x");   //0x60002000
  Serial.print(REG_SPI_BASE(1),HEX); 
  if (REG_SPI_BASE(1) > 0)
    Serial.println("   soc.h is correct ");
  else
    Serial.println("   soc.h is wrong ");
  
  Serial.print("REG_SPI_BASE(2) : 0x");   //0x60024000
  Serial.println(REG_SPI_BASE(2),HEX); 

Serial.println("start tft.init() ");
  tft.init(); 
Serial.println("done tft.init() ");

  // Backlight PWM Pin
  pinMode(pwmPin, OUTPUT);

  tft.fillScreen(TFT_BLUE);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(20, 130);
	tft.setTextSize(2);
  tft.print(F("Backlight Dimming"));
  
  delay(500);

  for (int i=255; i>0; i--) {
    analogWrite(pwmPin, i);
    delay(10);
    }
  for (int i=0; i<128; i++) {
    analogWrite(pwmPin, i);
    delay(10);
    }
  delay(500);
}

void loop(void)
{
  Serial.println("");
  Serial.print(F("Processor : ")); 
  #if defined(CONFIG_IDF_TARGET_ESP32S3)
    Serial.println("ESP32-S3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    Serial.println("ESP32-S2");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    Serial.println("ESP32-C3");  
  #elif defined(CONFIG_IDF_TARGET_ESP32C6)
    Serial.println("ESP32-C6");  
  #elif defined(CONFIG_IDF_TARGET_ESP32H2)
    Serial.println("ESP32-H2");  
  #elif defined (ESP32)
    Serial.println("ESP32");  
  #elif defined (ARDUINO_ARCH_ESP8266)
    Serial.println("ESP8266");  
  #elif defined (STM32)
    Serial.println("STM32");  
  #elif defined(ARDUINO_ARCH_RP2040)
    Serial.println("RP2040");  
  #elif defined(__LGT8FX8P__)
    Serial.println("LGT8FX");  
  #else
    Serial.println("Arduino");
  #endif

  Serial.print(F("ESP32     : ")); 
  Serial.print(ESP_ARDUINO_VERSION_MAJOR); 
  Serial.print("."); 
  Serial.print(ESP_ARDUINO_VERSION_MINOR); 
  Serial.print("."); 
  Serial.print(ESP_ARDUINO_VERSION_PATCH); 
  Serial.println("");

  Serial.print(F("TFT_eSPI  : ")); 
  Serial.println(TFT_ESPI_VERSION);
  
  Serial.print(F("SPI Write : ")); 
  Serial.print(SPI_FREQUENCY/1000000);
  Serial.println(F(" MHz")); 

  #if defined(USE_HSPI_PORT)
  Serial.println(F("#define USE_HSPI_PORT")); 
  #elif defined(USE_VSPI_PORT)
  Serial.println(F("#define USE_VSPI_PORT")); 
  #elif defined(USE_FSPI_PORT)
  Serial.println(F("#define USE_FSPI_PORT")); 
  #else
  Serial.println(F("no #define USE_xSPI_PORT")); 
  #endif

  Serial.print(F("MOSI ")); 
  Serial.print(TFT_MOSI);
  if (TFT_MOSI != MOSI) {
    Serial.print(F("/")); 
    Serial.print(MOSI);
  }  

  Serial.print(F(" - MISO ")); 
  Serial.print(TFT_MISO);
  if (TFT_MISO != MISO) {
    Serial.print(F("/")); 
    Serial.print(MISO);
  }

  Serial.print(F(" - SCLK ")); 
  Serial.print(TFT_SCLK);
  if (TFT_SCLK != SCK) {
    Serial.print(F("/")); 
    Serial.print(SCK);
  }
  Serial.print(F(" - CS  ")); 
  Serial.print(TFT_CS);
  if (TFT_CS != SS) {
    Serial.print(F("/")); 
    Serial.print(SS);
  }

  Serial.print(F(" - DC  ")); 
  Serial.print(TFT_DC);

  Serial.print(F(" - RST ")); 
  Serial.print(TFT_RST);

  #if defined(TOUCH_CS)
    Serial.print(F(" - TOUCH_CS ")); 
    Serial.println(TOUCH_CS);
  #endif

  Serial.println("");
	Serial.println(F("Benchmark                Time (microseconds)"));

	uint32_t usecHaD = testHaD();
	Serial.print(F("HaD pushColor            "));
	Serial.println(usecHaD);
	delay(500);

	uint32_t usecFillScreen = testFillScreen();
	Serial.print(F("Screen fill              "));
	Serial.println(usecFillScreen);
	delay(500);

	uint32_t usecText = testText();
	Serial.print(F("Text                     "));
	Serial.println(usecText);
	delay(500);

	uint32_t usecPixels = testPixels();
	Serial.print(F("Pixels                   "));
	Serial.println(usecPixels);
	delay(500);

	uint32_t usecLines = testLines(TFT_BLUE);
	Serial.print(F("Lines                    "));
	Serial.println(usecLines);
	delay(500);

	uint32_t usecFastLines = testFastLines(TFT_RED, TFT_BLUE);
	Serial.print(F("Horiz/Vert Lines         "));
	Serial.println(usecFastLines);
	delay(500);

	uint32_t usecRects = testRects(TFT_GREEN);
	Serial.print(F("Rectangles (outline)     "));
	Serial.println(usecRects);
	delay(500);

