mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_C6/Arduino/ESP32_C6_TFT_graphicstest_240x280/ESP32_C6_TFT_graphicstest_240x280.ino
	tft.fillScreen(TFT_BLACK);
	n = min(cx, cy);

	start = micros_start();

	for (i = 0; i < n; i += 5)
	{
		tft.drawTriangle(
			cx		, cy - i, // peak
			cx - i, cy + i, // bottom left
			cx + i, cy + i, // bottom right
			tft.color565(0, 0, i));
	}

	return micros() - start;
}

uint32_t testFilledTriangles()
{
	uint32_t start, t = 0;
	int32_t i;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);

	start = micros_start();

	for (i = min(cx,cy); i > 10; i -= 5) {
		start = micros_start();
		tft.fillTriangle(cx, cy - i, cx - i, cy + i, cx + i, cy + i,
			tft.color565(0, i, i));
		t += micros() - start;
		tft.drawTriangle(cx, cy - i, cx - i, cy + i, cx + i, cy + i,
			tft.color565(i, i, 0));
	}

	return t;
}

uint32_t testRoundRects()
 {
	uint32_t start;
	int32_t w, i, i2;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);
	
	w = min(tft.width(), tft.height());
	
	start = micros_start();

	for (i = 0; i < w; i += 6)
	{
		i2 = i / 2;
		tft.drawRoundRect(cx-i2, cy-i2, i, i, i/8, tft.color565(i, 0, 0));
	}

	return micros() - start;
}

uint32_t testFilledRoundRects()
{
	uint32_t start;
	int32_t i, i2;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);

	start = micros_start();

	for (i = min(tft.width(), tft.height()); i > 20; i -= 6)
	{
		i2 = i / 2;
		tft.fillRoundRect(cx-i2, cy-i2, i, i, i/8, tft.color565(0, i, 0));
	}

	return micros() - start;
}
/*

Processor : ESP32-C6
ESP32     : 3.0.3
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 19 - MISO 20 - SCLK 21 - CS  18 - DC  9 - RST 3
Benchmark                Time (microseconds)
HaD pushColor            152658
Screen fill              28591
Text                     26191
Pixels                   442059
Lines                    482867
Horiz/Vert Lines         13526
Rectangles (outline)     10069
Rectangles (filled)      339585
Circles (filled)         61575
Circles (outline)        44783
Triangles (outline)      32518
Triangles (filled)       134309
Rounded rects (outline)  26285
Rounded rects (filled)   349449
Done!


-------------------------------------------------------

Processor : ESP32-C3
ESP32     : 3.0.2
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 6 - MISO 5 - SCLK 4 - CS  7 - DC  19 - RST -1
Benchmark                Time (microseconds)
HaD pushColor            81159
Screen fill              14498
Text                     15418
Pixels                   241329
Lines                    261915
Horiz/Vert Lines         7318
Rectangles (outline)     5380
Rectangles (filled)      172303
Circles (filled)         33952
Circles (outline)        24866
Triangles (outline)      17983
Triangles (filled)       69931
Rounded rects (outline)  14623
Rounded rects (filled)   177983
Done!

=========== Before Setup Start ===========
Chip Info:
------------------------------------------
  Model             : ESP32-C6
  Package           : 0
  Revision          : 0
  Cores             : 1
  CPU Frequency     : 160 MHz
  XTAL Frequency    : 40 MHz
  Embedded Flash    : No
  Embedded PSRAM    : No
  2.4GHz WiFi       : Yes
  Classic BT        : No
  BT Low Energy     : Yes
  IEEE 802.15.4     : Yes
------------------------------------------
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   474524 B ( 463.4 KB)
  Free Bytes        :   445020 B ( 434.6 KB)
  Allocated Bytes   :    23128 B (  22.6 KB)
  Minimum Free Bytes:   439952 B ( 429.6 KB)
  Largest Free Block:   417780 B ( 408.0 KB)
------------------------------------------
Flash Info:
------------------------------------------
  Chip Size         :  8388608 B (8 MB)
  Block Size        :    65536 B (  64.0 KB)
  Sector Size       :     4096 B (   4.0 KB)
  Page Size         :      256 B (   0.2 KB)
  Bus Speed         : 40 MHz
  Bus Mode          : QIO
------------------------------------------
Partitions Info:
------------------------------------------
                nvs : addr: 0x00009000, size:    20.0 KB, type: DATA, subtype: NVS
            otadata : addr: 0x0000E000, size:     8.0 KB, type: DATA, subtype: OTA
               app0 : addr: 0x00010000, size:  1280.0 KB, type:  APP, subtype: OTA_0
               app1 : addr: 0x00150000, size:  1280.0 KB, type:  APP, subtype: OTA_1
             spiffs : addr: 0x00290000, size:  1408.0 KB, type: DATA, subtype: SPIFFS
           coredump : addr: 0x003F0000, size:    64.0 KB, type: DATA, subtype: COREDUMP
------------------------------------------
Software Info:
------------------------------------------
  Compile Date/Time : Jul 18 2024 22:44:03
  Compile Host OS   : windows
  ESP-IDF Version   : v5.1.4-497-gdc859c1e67-dirty
  Arduino Version   : 3.0.3
------------------------------------------
Board Info:
------------------------------------------
  Arduino Board     : ESP32C6_DEV
  Arduino Variant   : esp32c6
  Arduino FQBN      : esp32:esp32:esp32c6:UploadSpeed=921600,CDCOnBoot=cdc,CPUFreq=160,FlashFreq=80,FlashMode=qio,FlashSize=4M,PartitionScheme=default,DebugLevel=verbose,EraseFlash=none,JTAGAdapter=default,ZigbeeMode=default
============ Before Setup End ============
[   954][I][esp32-hal-periman.c:141] perimanSetPinBus(): Pin 12 already has type USB_DM (38) with bus 0x4080da9c
[   954][I][esp32-hal-periman.c:141] perimanSetPinBus(): Pin 13 already has type USB_DP (39) with bus 0x4080da9c

Bodmer's TFT_eSPI library Test!
no #define USE_xSPI_PORT
FSPI : 0
HSPI : 1
VSPI : 0
SPI_PORT : 2
SPI2_HOST : 1
DR_REG_SPI1_BASE : 0x60003000
DR_REG_SPI2_BASE : 0x60081000
REG_SPI_BASE(1) : 0x60001000   soc.h is correct 
REG_SPI_BASE(2) : 0x60081000
start tft.init() 
[   955][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   956][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type GPIO (1) with bus 0x13
[   956][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   957][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 9 successfully set to type GPIO (1) with bus 0xa
[   957][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   958][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 3 successfully set to type GPIO (1) with bus 0x4
[   958][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_SCK (34) successfully set to 0x4200ba64
[   959][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_MISO (35) successfully set to 0x4200b95e
[   960][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_MOSI (36) successfully set to 0x4200b856
[   960][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_SS (37) successfully set to 0x4200b81e
[   961][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   961][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 21 successfully set to type GPIO (1) with bus 0x16
[   962][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 21 successfully set to type SPI_MASTER_SCK (34) with bus 0x1
[   963][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   963][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 20 successfully set to type GPIO (1) with bus 0x15
[   964][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 20 successfully set to type SPI_MASTER_MISO (35) with bus 0x1
[   964][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[   965][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 19 successfully set to type GPIO (1) with bus 0x14
[   965][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 19 successfully set to type SPI_MASTER_MOSI (36) with bus 0x1
done tft.init() 
[  1539][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008fba
[  1539][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 2 successfully set to type GPIO (1) with bus 0x3
[  2071][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 2 successfully set to type INIT (0) with bus 0x0
[  2071][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type LEDC (9) successfully set to 0x4200921a
[  2072][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 2 successfully set to type LEDC (9) with bus 0x408121ec
[  2072][I][esp32-hal-ledc.c:151] ledcAttachChannel(): LEDC attached to pin 2 (channel 0, resolution 8)
=========== After Setup Start ============
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   474524 B ( 463.4 KB)
  Free Bytes        :   444388 B ( 434.0 KB)
  Allocated Bytes   :    23592 B (  23.0 KB)
  Minimum Free Bytes:   439928 B ( 429.6 KB)
  Largest Free Block:   417780 B ( 408.0 KB)
------------------------------------------
GPIO Info:
------------------------------------------
  GPIO : BUS_TYPE[bus/unit][chan]
  --------------------------------------  
     2 : LEDC[0][0]
     3 : GPIO
     9 : GPIO
    12 : USB_DM
    13 : USB_DP
    16 : UART_TX[0]
    17 : UART_RX[0]
    18 : GPIO
    19 : SPI_MASTER_MOSI[0]
    20 : SPI_MASTER_MISO[0]
    21 : SPI_MASTER_SCK[0]
============ After Setup End =============

Processor : ESP32-C6
ESP32     : 3.0.3
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 19 - MISO 20 - SCLK 21 - CS  18 - DC  9 - RST 3
Benchmark                Time (microseconds)
HaD pushColor            152681
Screen fill              28593
Text                     26296
Pixels                   442381
Lines                    483462
Horiz/Vert Lines         13531
Rectangles (outline)     10099
Rectangles (filled)      339642
Circles (filled)         61608
Circles (outline)        44845
Triangles (outline)      32570
Triangles (filled)       134474
Rounded rects (outline)  26374
Rounded rects (filled)   349527
Done!



/***************************************************
  Original sketch text:

  This is an example sketch for the Adafruit 2.2" SPI display.
  This library works with the Adafruit 2.2" TFT Breakout w/SD card
  ----> http://www.adafruit.com/products/1480
 
  Check out the links above for our tutorials and wiring diagrams
  These displays use SPI to communicate, 4 or 5 pins are required to
  interface (RST is optional)
  Adafruit invests time and resources providing this open source code,
  please support Adafruit and open-source hardware by purchasing
  products from Adafruit!

  Written by Limor Fried/Ladyada for Adafruit Industries.
  MIT license, all text above must be included in any redistribution
 ****************************************************/
 
